Workspace/run/flatplate/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

null_val        (1.e-5 1.e-5 1.e-5);

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (5.4 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (5.4 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    fixedWall
    {
        type            fixedValue;
        value           uniform $null_val;
    }

    above
    {
        type            zeroGradient;
    }

    top
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
