Workspace/run/flatplate/Allrun
#!/bin/sh

. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication decomposePar
runParallel `getApplication`
runApplication reconstructPar
